particle-iot/device-os/hal/network/ncp_client/esp32/esp32_ncp_client.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#define NO_STATIC_ASSERT
#include "logging.h"
LOG_SOURCE_CATEGORY("ncp.esp32.client");

#include "esp32_ncp_client.h"

#include "at_command.h"
#include "at_response.h"

#include "gpio_hal.h"
#include "timer_hal.h"
#include "delay_hal.h"
#include "serial_stream.h"

#include "xmodem_sender.h"
#include "stream_util.h"
#include "str_util.h"
#include "check.h"
#include "ncp.h"
#include "system_env.h"

#include <cstdlib>

#define CHECK_PARSER(_expr) \
        ({ \
            const auto _r = _expr; \
            if (_r < 0) { \
                this->parserError(_r); \
                return _r; \
            } \
            _r; \
        })

#define CHECK_PARSER_OK(_expr) \
        do { \
            const auto _r = _expr; \
            if (_r < 0) { \
                this->parserError(_r); \
                return _r; \
            } \
            if (_r != ::particle::AtResponse::OK) { \
                return SYSTEM_ERROR_AT_NOT_OK; \
            } \
        } while (false)

namespace particle {

namespace {

void espReset() {
    hal_gpio_write(ESPBOOT, 1);
    HAL_Delay_Milliseconds(100);
    hal_gpio_write(ESPEN, 0);
    HAL_Delay_Milliseconds(100);
    hal_gpio_write(ESPEN, 1);
    HAL_Delay_Milliseconds(100);
}

#if !HAL_PLATFORM_WIFI_SCAN_ONLY
size_t espEscape(const char* src, char* dest, size_t destSize) {
    return escape(src, ",\"\\", '\\', dest, destSize);
}
#endif // !HAL_PLATFORM_WIFI_SCAN_ONLY

const auto ESP32_NCP_MAX_MUXER_FRAME_SIZE = 1536;
const auto ESP32_NCP_KEEPALIVE_PERIOD = 5000; // milliseconds
const auto ESP32_NCP_KEEPALIVE_MAX_MISSED = 5;

// FIXME: for now using a very large buffer
const auto ESP32_NCP_AT_CHANNEL_RX_BUFFER_SIZE = 4096;

const auto ESP32_NCP_DEFAULT_SERIAL_BAUDRATE = 921600;
const auto ESP32_NCP_DEFAULT_SDIO_SPEED = 8000000;  // 8MHz

const auto ESP32_NCP_AT_CHANNEL = 1;
const auto ESP32_NCP_STA_CHANNEL = 2;
const auto ESP32_NCP_AP_CHANNEL = 3;

#if !HAL_PLATFORM_WIFI_NCP_SDIO
const auto ESP32_NCP_MIN_MVER_WITH_CMUX = 4;
#else
// FIXME:
const auto ESP32_NCP_MIN_MVER_WITH_CMUX = 7;
#endif // !HAL_PLATFORM_WIFI_NCP_SDIO

} // unnamed

Esp32NcpClient::Esp32NcpClient() :
        ncpState_(NcpState::OFF),
        prevNcpState_(NcpState::OFF),
        connState_(NcpConnectionState::DISCONNECTED),
        parserError_(0),
        ready_(false),
        muxerNotStarted_(false) {
}

Esp32NcpClient::~Esp32NcpClient() {
    destroy();
}

int Esp32NcpClient::init(const NcpClientConfig& conf) {
    // Make sure ESP32 is powered down
    hal_gpio_mode(ESPBOOT, OUTPUT);
    hal_gpio_write(ESPBOOT, 1);
#if PLATFORM_ID == PLATFORM_ARGON
    hal_gpio_mode(ESPEN, OUTPUT_OPEN_DRAIN);
#elif PLATFORM_ID == PLATFORM_ASOM || PLATFORM_ID == PLATFORM_TRACKER
    hal_gpio_mode(ESPEN, OUTPUT);
#endif
    espOff();

#if !HAL_PLATFORM_WIFI_NCP_SDIO
    // Initialize serial stream
    std::unique_ptr<SerialStream> serial(new(std::nothrow) SerialStream(HAL_PLATFORM_WIFI_SERIAL, ESP32_NCP_DEFAULT_SERIAL_BAUDRATE,
            SERIAL_8N1 | SERIAL_FLOW_CONTROL_RTS_CTS));
#else
    std::unique_ptr<Esp32SdioStream> serial(new(std::nothrow) Esp32SdioStream(HAL_SPI_INTERFACE2, ESP32_NCP_DEFAULT_SDIO_SPEED, WIFI_CS, WIFI_INT));
#endif // !HAL_PLATFORM_WIFI_NCP_SDIO
    CHECK_TRUE(serial, SYSTEM_ERROR_NO_MEMORY);
    // Initialize muxed channel stream
    decltype(muxerAtStream_) muxStrm(new(std::nothrow) decltype(muxerAtStream_)::element_type(&muxer_, ESP32_NCP_AT_CHANNEL));
    CHECK_TRUE(muxStrm, SYSTEM_ERROR_NO_MEMORY);
    CHECK(muxStrm->init(ESP32_NCP_AT_CHANNEL_RX_BUFFER_SIZE));
    CHECK(initParser(serial.get()));
    serial_ = std::move(serial);
    muxerAtStream_ = std::move(muxStrm);
    conf_ = conf;
    ncpState_ = NcpState::OFF;
    prevNcpState_ = NcpState::OFF;
    connState_ = NcpConnectionState::DISCONNECTED;
    parserError_ = 0;
    ready_ = false;
    muxerNotStarted_ = false;
    pwrState_ = NcpPowerState::UNKNOWN;
    // We know for a fact that ESP32 is off on boot because we've initialized ESPEN pin to output 0
    ncpPowerState(NcpPowerState::OFF);
    return 0;
}

int Esp32NcpClient::initParser(Stream* stream) {
    // Initialize AT parser
    auto parserConf = AtParserConfig()
            .stream(stream)
            .commandTerminator(AtCommandTerminator::CRLF)
            .logCategory("ncp.esp32.at");
    parser_.destroy();
    CHECK(parser_.init(std::move(parserConf)));
    // Register URC handlers
    CHECK(parser_.addUrcHandler("WIFI CONNECTED", nullptr, nullptr)); // Ignore
    CHECK(parser_.addUrcHandler("WIFI DISCONNECT", [](AtResponseReader* reader, const char* prefix, void* data) {
        const auto self = (Esp32NcpClient*)data;
        self->connectionState(NcpConnectionState::DISCONNECTED);
        return 0;
    }, this));
    return 0;
}

void Esp32NcpClient::destroy() {
    if (ncpState_ != NcpState::OFF) {
        ncpState_ = NcpState::OFF;
        espOff();
    }
    parser_.destroy();
    muxerAtStream_.reset();
    serial_.reset();
}

int Esp32NcpClient::on() {
    const NcpClientLock lock(this);
    if (ncpState_ == NcpState::DISABLED) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (ncpState_ == NcpState::ON) {
        return 0;
    }

    bool enabled = true;
    particle::system::getEnv("PARTICLE_WIFI_ENABLE", enabled);
    if (!enabled) {
        return SYSTEM_ERROR_DISABLED;
    }

    if (!serial_->on()) {
        CHECK(serial_->on(true));
    }
    ncpPowerState(NcpPowerState::TRANSIENT_ON);
    CHECK(waitReady());
    ncpPowerState(NcpPowerState::ON);
    return 0;
}

int Esp32NcpClient::off() {
    const NcpClientLock lock(this);
    if (ncpState_ == NcpState::DISABLED) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    muxer_.stop();
    ncpPowerState(NcpPowerState::TRANSIENT_OFF);
    espOff();
    ready_ = false;
    ncpState(NcpState::OFF);
    // Disable the UART interface.
    LOG(TRACE, "Deinit modem serial.");
    serial_->on(false);
    ncpPowerState(NcpPowerState::OFF);
    return 0;
}

int Esp32NcpClient::enable() {
    const NcpClientLock lock(this);
    if (ncpState_ != NcpState::DISABLED) {
        return 0;
    }
    serial_->enabled(true);
    muxerAtStream_->enabled(true);
    ncpState_ = prevNcpState_;
    off();
    return 0;
}

void Esp32NcpClient::disable() {
    // This method is used to unblock the network interface thread, so we're not trying to acquire
    // the client lock here
    const NcpState state = ncpState_;
    if (state == NcpState::DISABLED) {
        return;
    }
    prevNcpState_ = state;
    ncpState_ = NcpState::DISABLED;
    serial_->enabled(false);
    muxerAtStream_->enabled(false);
}

NcpState Esp32NcpClient::ncpState() {
    return ncpState_;
}

NcpPowerState Esp32NcpClient::ncpPowerState() {
    return pwrState_;
}

int Esp32NcpClient::disconnect() {
    const NcpClientLock lock(this);
    if (ncpState_ == NcpState::DISABLED) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (connState_ == NcpConnectionState::DISCONNECTED) {
        return 0;
    }
#if !HAL_PLATFORM_WIFI_SCAN_ONLY
    CHECK(checkParser());
    const int r = CHECK_PARSER(parser_.execCommand("AT+CWQAP"));
    CHECK_TRUE(r == AtResponse::OK, SYSTEM_ERROR_AT_NOT_OK);
#endif // !HAL_PLATFORM_WIFI_SCAN_ONLY
    connectionState(NcpConnectionState::DISCONNECTED);
    return 0;
}

