particle-iot/device-os/hal/network/ncp_client/esp32/esp32_ncp_client.cpp
NcpConnectionState Esp32NcpClient::connectionState() {
    return connState_;
}

int Esp32NcpClient::getFirmwareVersionString(char* buf, size_t size) {
    const NcpClientLock lock(this);
    CHECK(checkParser());
    auto resp = parser_.sendCommand("AT+CGMR");
    CHECK_PARSER(resp.readLine(buf, size));
    const int r = CHECK_PARSER(resp.readResult());
    CHECK_TRUE(r == AtResponse::OK, SYSTEM_ERROR_AT_NOT_OK);
    return 0;
}

int Esp32NcpClient::getFirmwareModuleVersion(uint16_t* ver) {
    const NcpClientLock lock(this);
    CHECK(checkParser());
    return getFirmwareModuleVersionImpl(ver);
}

int Esp32NcpClient::getFirmwareModuleVersionImpl(uint16_t* ver) {
    char buf[16] = {};
    auto resp = parser_.sendCommand("AT+MVER");
    CHECK_PARSER(resp.readLine(buf, sizeof(buf)));
    const int r = CHECK_PARSER(resp.readResult());
    CHECK_TRUE(r == AtResponse::OK, SYSTEM_ERROR_AT_NOT_OK);
    CHECK_TRUE(buf[0] != '\0', SYSTEM_ERROR_UNKNOWN);
    char* end = nullptr;
    const auto val = strtol(buf, &end, 10);
    CHECK_TRUE(end != nullptr && *end == '\0', SYSTEM_ERROR_UNKNOWN);
    *ver = val;
    return 0;
}

int Esp32NcpClient::updateFirmware(InputStream* file, size_t size) {
#if !HAL_PLATFORM_NCP_UPDATES_DISABLED
    const NcpClientLock lock(this);
    CHECK(checkParser());
    auto resp = parser_.sendCommand("AT+FWUPD=%u", (unsigned)size);
    char buf[32] = {};
    CHECK_PARSER(resp.readLine(buf, sizeof(buf)));
    if (strcmp(buf, "+FWUPD: ONGOING") != 0) {
        return SYSTEM_ERROR_UNKNOWN;
    }
    LOG(TRACE, "Initiating XMODEM transfer");
    parser_.reset();
    const auto strm = parser_.config().stream();
    CHECK(skipWhitespace(strm, 1000));
    XmodemSender sender;
    CHECK(sender.init(strm, file, size));
    bool ok = false;
    for (;;) {
        const int r = sender.run();
        if (r != XmodemSender::RUNNING) {
            if (r == XmodemSender::DONE) {
                LOG(INFO, "XMODEM transfer finished");
                ok = true;
            } else {
                LOG(ERROR, "XMODEM transfer failed: %d", r);
            }
            break;
        }
        // FIXME: XModem sender runs in a busy loop and for some reason
        // under some conditions doesn't allow any other even higher priority
        // threads to be scheduled. Most likely this is some kind of an issue
        // with priority inheritance. As a temporary workaround, we'll just
        // add a 1 tick delay here which should guarantee that other threads
        // get CPU time.
        HAL_Delay_Milliseconds(1);
    }
    if (!ok) {
        CHECK(skipAll(strm, 3000));
        return SYSTEM_ERROR_UNKNOWN;
    }
    CHECK(skipNonPrintable(strm, 30000));
    CHECK(readLine(strm, buf, sizeof(buf), 1000));
    if (strcmp(buf, "OK") != 0) {
        LOG(ERROR, "Unexpected result code: \"%s\"", buf);
        return SYSTEM_ERROR_UNKNOWN;
    }
    // Stop the muxer
    muxer_.stop();
    // Wait a bit for the NCP to reset
    HAL_Delay_Milliseconds(2000);
    // Re-enable the client in case it was asynchronously disabled by the muxer
    // due to the NCP reset
    enable();
    // FIXME: Find a better way to reset the client state
    off();
    CHECK(on());
    return 0;
#else
    return SYSTEM_ERROR_NOT_SUPPORTED;
#endif // !HAL_PLATFORM_NCP_UPDATES_DISABLED
}

void Esp32NcpClient::processEvents() {
    const NcpClientLock lock(this);
    if (ncpState_ != NcpState::ON) {
        return;
    }
    parser_.processUrc();
}

AtParser* Esp32NcpClient::atParser() {
    return &parser_;
}

int Esp32NcpClient::connect(const char* ssid, const MacAddress& bssid, WifiSecurity sec, const WifiCredentials& cred) {
#if !HAL_PLATFORM_WIFI_SCAN_ONLY
    const NcpClientLock lock(this);
    CHECK_TRUE(connState_ == NcpConnectionState::DISCONNECTED, SYSTEM_ERROR_INVALID_STATE);
    CHECK(checkParser());

    // Open data channel and resume it just in case
    inFlowControl_ = false;
    int r = muxer_.openChannel(ESP32_NCP_STA_CHANNEL, [](const uint8_t* data, size_t size, void* ctx) -> int {
        auto self = (Esp32NcpClient*)ctx;
        const auto handler = self->conf_.dataHandler();
        if (handler) {
            handler(0, data, size, self->conf_.dataHandlerData());
        }
        return SYSTEM_ERROR_NONE;
    }, this);
    // We are running an older NCP firmware without muxer support, ignore error here
    CHECK_TRUE(r == 0 || (r == gsm0710::GSM0710_ERROR_INVALID_STATE && muxerNotStarted_),
            SYSTEM_ERROR_UNKNOWN);
    muxer_.resumeChannel(ESP32_NCP_STA_CHANNEL);

    auto cmd = parser_.command();
    char escSsid[MAX_SSID_SIZE * 2 + 1] = {}; // Escaped SSID
    espEscape(ssid, escSsid, sizeof(escSsid) - 1);
    cmd.printf("AT+CWJAP=\"%s\"", escSsid);
    switch (cred.type()) {
    case WifiCredentials::PASSWORD: {
        LOG(TRACE, "Connecting to \"%s\"", ssid);
        char escPwd[MAX_WPA_WPA2_PSK_SIZE * 2 + 1] = {}; // Escaped password
        espEscape(cred.password(), escPwd, sizeof(escPwd) - 1);
        cmd.printf(",\"%s\"", escPwd);
        break;
    }
    case WifiCredentials::NONE: {
        LOG(TRACE, "Connecting to \"%s\" (no security)", ssid);
        cmd.print(",\"\"");
        break;
    }
    default:
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    if (bssid != INVALID_MAC_ADDRESS) {
        char bssidStr[MAC_ADDRESS_STRING_SIZE + 1] = {};
        macAddressToString(bssid, bssidStr, sizeof(bssidStr));
        cmd.printf(",\"%s\"", bssidStr);
    }
    parser_.logEnabled(false); // Avoid logging the password
    auto resp = cmd.send();
    parser_.logEnabled(AtParserConfig::DEFAULT_LOG_ENABLED);
    r = CHECK_PARSER(resp.readResult());
    CHECK_TRUE(r == AtResponse::OK, SYSTEM_ERROR_AT_NOT_OK);
    connectionState(NcpConnectionState::CONNECTED);
    return 0;
#else
    return SYSTEM_ERROR_NOT_SUPPORTED;
#endif // !HAL_PLATFORM_WIFI_SCAN_ONLY
}

int Esp32NcpClient::getNetworkInfo(WifiNetworkInfo* info) {
#if !HAL_PLATFORM_WIFI_SCAN_ONLY
    const NcpClientLock lock(this);
    CHECK_TRUE(connState_ == NcpConnectionState::CONNECTED, SYSTEM_ERROR_INVALID_STATE);
    CHECK(checkParser());
    auto resp = parser_.sendCommand("AT+CWJAP?");
    char ssid[MAX_SSID_SIZE + 1] = {};
    char bssidStr[MAC_ADDRESS_STRING_SIZE + 1] = {};
    int channel = 0;
    int rssi = 0;
    int r = CHECK_PARSER(resp.scanf("+CWJAP: \"%32[^\"]\",\"%17[^\"]\",%d,%d", ssid, bssidStr, &channel, &rssi));
    CHECK_TRUE(r == 4, SYSTEM_ERROR_AT_RESPONSE_UNEXPECTED);
    MacAddress bssid = INVALID_MAC_ADDRESS;
    CHECK_TRUE(macAddressFromString(&bssid, bssidStr), SYSTEM_ERROR_UNKNOWN);
    r = CHECK_PARSER(resp.readResult());
    CHECK_TRUE(r == AtResponse::OK, SYSTEM_ERROR_AT_NOT_OK);
    *info = WifiNetworkInfo().ssid(ssid).bssid(bssid).channel(channel).rssi(rssi);
    return 0;
#else
    return SYSTEM_ERROR_NOT_SUPPORTED;
#endif // !HAL_PLATFORM_WIFI_SCAN_ONLY
}

int Esp32NcpClient::scan(WifiScanCallback callback, void* data, bool forConnect) {
    const NcpClientLock lock(this);
    CHECK(checkParser());
    auto resp = parser_.sendCommand("AT+CWLAP");
    while (resp.hasNextLine()) {
        char ssid[MAX_SSID_SIZE + 2] = {};
        char bssidStr[MAC_ADDRESS_STRING_SIZE + 1] = {};
        int security = 0;
        int channel = 0;
        int rssi = 0;
        const int r = CHECK_PARSER(resp.scanf("+CWLAP:(%d,\"%33[^,],%d,\"%17[^\"]\",%d)", &security, ssid, &rssi,
                bssidStr, &channel));
        if (r != 5) {
            // FIXME: ESP32 doesn't escape special characters, such as ',' and '"', in SSIDs. For now,
            // we're skipping such entries
            LOG(WARN, "Unable to parse AP info");
            continue;
        }
        // Fixup SSID
        CHECK_TRUE(strlen(ssid) > 0, SYSTEM_ERROR_UNKNOWN);
        ssid[strlen(ssid) - 1] = '\0';
        MacAddress bssid = INVALID_MAC_ADDRESS;
        CHECK_TRUE(macAddressFromString(&bssid, bssidStr), SYSTEM_ERROR_UNKNOWN);
        auto result = WifiScanResult().ssid(ssid).bssid(bssid).security((WifiSecurity)security).channel(channel)
                .rssi(rssi);
        CHECK(callback(std::move(result), data));
    }
    const int r = CHECK_PARSER(resp.readResult());
    CHECK_TRUE(r == AtResponse::OK, SYSTEM_ERROR_AT_NOT_OK);
    return 0;
}

