particle-iot/device-os/hal/network/ncp_client/esp32/esp32_ncp_client.cpp
int Esp32NcpClient::getMacAddress(MacAddress* addr) {
    const NcpClientLock lock(this);
    CHECK(checkParser());
    return getMacAddressImpl(addr);
}

int Esp32NcpClient::getMacAddressImpl(MacAddress* addr) {
    auto resp = parser_.sendCommand("AT+GETMAC=0"); // WiFi station
    char addrStr[MAC_ADDRESS_STRING_SIZE + 1] = {};
    int r = CHECK_PARSER(resp.scanf("+GETMAC: \"%32[^\"]\"", addrStr));
    CHECK_TRUE(r == 1, SYSTEM_ERROR_AT_RESPONSE_UNEXPECTED);
    CHECK_TRUE(macAddressFromString(addr, addrStr), SYSTEM_ERROR_BAD_DATA);
    r = CHECK_PARSER(resp.readResult());
    CHECK_TRUE(r == AtResponse::OK, SYSTEM_ERROR_AT_NOT_OK);
    return 0;
}

int Esp32NcpClient::checkParser() {
    CHECK_TRUE(pwrState_ == NcpPowerState::ON, SYSTEM_ERROR_INVALID_STATE);
    CHECK_TRUE(ncpState_ == NcpState::ON, SYSTEM_ERROR_INVALID_STATE);
    if (ready_ && parserError_ != 0) {
        const int r = parser_.execCommand(1000, "AT");
        if (r == AtResponse::OK) {
            parserError_ = 0;
        } else {
            ready_ = false;
        }
    }
    CHECK(waitReady());
    return 0;
}

int Esp32NcpClient::waitReady() {
    if (ready_) {
        return 0;
    }
    muxer_.stop();
    espReset();
#if !HAL_PLATFORM_WIFI_NCP_SDIO
    CHECK(serial_->setBaudRate(ESP32_NCP_DEFAULT_SERIAL_BAUDRATE));
#else
    // SDIO bus initialization only performs right after power on
    CHECK(serial_->init());
#endif // !HAL_PLATFORM_WIFI_NCP_SDIO

    CHECK(initParser(serial_.get()));
    skipAll(serial_.get(), 1000);

    parser_.reset();
    const unsigned timeout = 10000;
    const auto t1 = HAL_Timer_Get_Milli_Seconds();
    for (;;) {
        const int r = parser_.execCommand(1000, "AT");
        if (r == AtResponse::OK) {
            ready_ = true;
            break;
        }
        const auto t2 = HAL_Timer_Get_Milli_Seconds();
        if (t2 - t1 >= timeout) {
            break;
        }
        if (r != SYSTEM_ERROR_TIMEOUT) {
            HAL_Delay_Milliseconds(1000);
        }
    }

    if (ready_) {
        skipAll(serial_.get(), 1000);
        parser_.reset();
        parserError_ = 0;
        LOG(TRACE, "NCP ready to accept AT commands");

        auto r = initReady();
        if (r != SYSTEM_ERROR_NONE) {
            LOG(ERROR, "Failed to perform early initialization");
            ready_ = false;
        }
    } else {
        LOG(ERROR, "No response from NCP");
    }

    if (!ready_) {
        espOff();
        ncpState(NcpState::OFF);
        return SYSTEM_ERROR_INVALID_STATE;
    }

    return 0;
}

int Esp32NcpClient::initReady() {
    uint16_t mver = 0;
    MacAddress mac = {};
    CHECK(getFirmwareModuleVersionImpl(&mver));
    CHECK(getMacAddressImpl(&mac));
    CHECK(wifiNcpUpdateInfoCache(mver, mac));

    if (mver >= ESP32_NCP_MIN_MVER_WITH_CMUX) {
#if HAL_PLATFORM_WIFI_NCP_SDIO
        serial_->txInterruptSupported(true);
#endif
        // Send AT+CMUX and initialize multiplexer
        CHECK_PARSER_OK(parser_.execCommand("AT+CMUX=0"));
        CHECK(initMuxer());
        muxerNotStarted_ = false;
    } else {
        muxerNotStarted_ = true;
    }

    // Disable DHCP on both STA and AP interfaces
    CHECK_PARSER_OK(parser_.execCommand("AT+CWDHCP=0,3"));

    // Now we are ready
    ncpState(NcpState::ON);
    return 0;
}

int Esp32NcpClient::initMuxer() {
    // Initialize muxer
    muxer_.setStream(serial_.get());
    muxer_.setMaxFrameSize(ESP32_NCP_MAX_MUXER_FRAME_SIZE);
    muxer_.setKeepAlivePeriod(ESP32_NCP_KEEPALIVE_PERIOD * 2);
    muxer_.setKeepAliveMaxMissed(ESP32_NCP_KEEPALIVE_MAX_MISSED);
    muxer_.setMaxRetransmissions(3);
    muxer_.setAckTimeout(2530);
    muxer_.setControlResponseTimeout(2540);
    muxer_.setLogCategory("ncp.esp32.mux");

    // Set channel state handler
    muxer_.setChannelStateHandler(muxChannelStateCb, this);

    // Start muxer (blocking call)
    CHECK_TRUE(muxer_.start(true) == 0, SYSTEM_ERROR_UNKNOWN);

    // Open AT channel and connect it to AT channel stream
    if (muxer_.openChannel(ESP32_NCP_AT_CHANNEL, muxerAtStream_->channelDataCb, muxerAtStream_.get())) {
        // Failed to open AT channel
        muxer_.stop();
        return SYSTEM_ERROR_UNKNOWN;
    }
    // Just in case resume AT channel
    muxer_.resumeChannel(ESP32_NCP_AT_CHANNEL);

    // Reinitialize parser with a muxer-based stream
    CHECK(initParser(muxerAtStream_.get()));

    const unsigned timeout = 5000;
    const auto t1 = HAL_Timer_Get_Milli_Seconds();
    for (;;) {
        const int r = parser_.execCommand(1000, "AT");
        if (r == AtResponse::OK) {
            // Success, remote end answered to an AT command
            LOG_DEBUG(TRACE, "Muxer AT channel live");
            return 0;
        }
        const auto t2 = HAL_Timer_Get_Milli_Seconds();
        if (t2 - t1 >= timeout) {
            break;
        }
        if (r != SYSTEM_ERROR_TIMEOUT) {
            HAL_Delay_Milliseconds(1000);
        }
    }

    return SYSTEM_ERROR_UNKNOWN;
}

void Esp32NcpClient::ncpState(NcpState state) {
    if (ncpState_ == NcpState::DISABLED) {
        return;
    }
    if (state == NcpState::OFF) {
        ready_ = false;
        connectionState(NcpConnectionState::DISCONNECTED);
    }

    if (ncpState_ == state) {
        return;
    }
    ncpState_ = state;
    LOG(TRACE, "NCP state changed: %d", (int)ncpState_);

    const auto handler = conf_.eventHandler();
    if (handler) {
        NcpStateChangedEvent event = {};
        event.type = NcpEvent::NCP_STATE_CHANGED;
        event.state = ncpState_;
        handler(event, conf_.eventHandlerData());
    }
}

void Esp32NcpClient::ncpPowerState(NcpPowerState state) {
    if (pwrState_ == state) {
        return;
    }
    pwrState_ = state;
    const auto handler = conf_.eventHandler();
    if (handler) {
        NcpPowerStateChangedEvent event = {};
        event.type = NcpEvent::POWER_STATE_CHANGED;
        event.state = pwrState_;
        handler(event, conf_.eventHandlerData());
    }
}

void Esp32NcpClient::connectionState(NcpConnectionState state) {
    if (ncpState_ == NcpState::DISABLED) {
        return;
    }
    if (connState_ == state) {
        return;
    }
    LOG(TRACE, "NCP connection state changed: %d", (int)state);
    connState_ = state;
    const auto handler = conf_.eventHandler();
    if (handler) {
        NcpConnectionStateChangedEvent event = {};
        event.type = NcpEvent::CONNECTION_STATE_CHANGED;
        event.state = connState_;
        handler(event, conf_.eventHandlerData());
    }
}

int Esp32NcpClient::muxChannelStateCb(uint8_t channel, decltype(muxer_)::ChannelState oldState,
        decltype(muxer_)::ChannelState newState, void* ctx) {
    auto self = (Esp32NcpClient*)ctx;
    // This callback is executed from the multiplexer thread, not safe to use the lock here
    // because it might get called while blocked inside some muxer function

    // We are only interested in Closed state
    if (newState == decltype(muxer_)::ChannelState::Closed) {
        switch (channel) {
            case 0:
                // Muxer stopped
                self->disable();
                break;
            case ESP32_NCP_STA_CHANNEL: {
                // Notify that the underlying data channel closed
                // It should be safe to call this here
                self->connectionState(NcpConnectionState::DISCONNECTED);
                break;
            }
        }
    }

    return 0;
}

int Esp32NcpClient::dataChannelWrite(int id, const uint8_t* data, size_t size) {
    int err = SYSTEM_ERROR_NONE;
    if (id == 0) {
        err = muxer_.writeChannel(ESP32_NCP_STA_CHANNEL, data, size);
    } else if (id == 1) {
        err = muxer_.writeChannel(ESP32_NCP_AP_CHANNEL, data, size);
    } else {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (err == gsm0710::GSM0710_ERROR_FLOW_CONTROL) {
        // Not an error
        LOG_DEBUG(WARN, "Remote side flow control");
        err = 0;
    }

    if (err) {
        // Make sure we are going into an error state if muxer for some reason fails
        // to write into the data channel.
        LOG(ERROR, "Failed to write into data channel %d", err);
        disable();
    }

    return err;
}

int Esp32NcpClient::dataChannelFlowControl(bool state) {
    // FIXME: only STA channel
    CHECK_TRUE(connState_ == NcpConnectionState::CONNECTED, SYSTEM_ERROR_INVALID_STATE);
    if (state && !inFlowControl_) {
        inFlowControl_ = true;
        muxer_.suspendChannel(ESP32_NCP_STA_CHANNEL);
    } else if (!state && inFlowControl_) {
        inFlowControl_ = false;
        muxer_.resumeChannel(ESP32_NCP_STA_CHANNEL);
    }
    return 0;
}

int Esp32NcpClient::espOff() {
    hal_gpio_write(ESPEN, 0);
    serial_->on(false);
    ncpPowerState(NcpPowerState::OFF);
    return 0;
}

} // particle
